src/ЗУП/cfe/рг_УниверсальныйОбменXML/Catalogs/рг_НастройкиОбменаXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рг_НастройкиОбменаXML</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксБазыПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рг_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОбменаДанными</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаПравил</Name>
					<Comment>deprecated (v2)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ЗУП/cfe/рг_УниверсальныйОбменXML/Catalogs/рг_НастройкиОбменаXML/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник Тогда
		
		Если НЕ ПравилаОбменаДаннымиЗаполнены() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для профиля-источника необходимо загрузить правила обмена.'"),
				ЭтотОбъект,
				"ПравилаОбменаДанными",
				"Объект",
				Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Префикс) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для профиля-источника необходимо указать префикс.'"),
				ЭтотОбъект,
				"Префикс",
				"Объект",
				Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПрефиксБазыПриемника) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для профиля-источника необходимо указать префикс базы приёмника.'"),
				ЭтотОбъект,
				"ПрефиксБазыПриемника",
				"Объект",
				Отказ);
		КонецЕсли;
		
		Если ЕстьДубльПрефиксовПрофиляИсточника() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Профиль-источник с такой парой префиксов уже существует.'"),
				ЭтотОбъект,
				"Префикс",
				"Объект",
				Отказ);
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для профиля-приёмника необходимо указать адрес сервиса.'"),
				ЭтотОбъект,
				"АдресСервиса",
				"Объект",
				Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Логин) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Для профиля-приёмника необходимо указать логин.'"),
				ЭтотОбъект,
				"Логин",
				"Объект",
				Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		РегламентныеЗаданияСервер.ЗаблокироватьРегламентноеЗадание(ИндентификаторРегламентногоЗадания);
		
		Задание = РегламентныеЗаданияСервер.Задание(ИндентификаторРегламентногоЗадания);
		Если Задание = Неопределено Тогда
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.рг_ВыполнениеОбменаXML);
			ПараметрыЗадания.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.рг_ВыполнениеОбменаXML.ИмяМетода);
			ПараметрыЗадания.Вставить("Использование", Ложь);
			ПараметрыЗадания.Вставить("Наименование", ПредставлениеЗаданияПоПрофилю(Наименование));
			Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
			
			ИндентификаторРегламентногоЗадания = РегламентныеЗаданияСервер.УникальныйИдентификатор(Задание);
			РегламентныеЗаданияСервер.ЗаблокироватьРегламентноеЗадание(ИндентификаторРегламентногоЗадания);
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник И ЗначениеЗаполнено(ИндентификаторРегламентногоЗадания) Тогда
		УстановитьПривилегированныйРежим(Истина);
		РегламентныеЗаданияСервер.УдалитьЗадание(ИндентификаторРегламентногоЗадания);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИндентификаторРегламентногоЗадания = Неопределено;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник Тогда
		
		Если НужноОбновитьПарольВБезопасномХранилище() Тогда
			УстановитьПривилегированныйРежим(Истина);
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Ссылка, ДополнительныеСвойства.Пароль, "Пароль");
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗаданияСервер.Задание(ИндентификаторРегламентногоЗадания);
		Если Задание <> Неопределено Тогда
			
			Изменения = Новый Структура;
			РасписаниеРегламентногоОбмена = РасписаниеРегламентногоОбмена();
			
			ВключитьЗадание = ИспользоватьРасписание И РасписаниеРегламентногоОбменаЗаполнено(РасписаниеРегламентногоОбмена);
			Если Задание.Использование <> ВключитьЗадание Тогда
				Изменения.Вставить("Использование", ВключитьЗадание);
			КонецЕсли;
			
			Если РасписаниеРегламентногоОбменаЗаполнено(РасписаниеРегламентногоОбмена)
				И Строка(РасписаниеРегламентногоОбмена) <> Строка(Задание.Расписание) Тогда
				Изменения.Вставить("Расписание", РасписаниеРегламентногоОбмена);
			КонецЕсли;
			
			Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
				НаименованиеЗадания = ПредставлениеЗаданияПоПрофилю(Наименование);
				Если Задание.Наименование <> НаименованиеЗадания Тогда
					Изменения.Вставить("Наименование", НаименованиеЗадания);
				КонецЕсли;
			КонецЕсли;
			
			Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Ссылка Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка);
				Изменения.Вставить("Параметры", ПараметрыЗадания);
			КонецЕсли;
			
			Если Изменения.Количество() > 0 Тогда
				РегламентныеЗаданияСервер.ИзменитьЗадание(ИндентификаторРегламентногоЗадания, Изменения);
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры
// ВдовинПЮ: ---

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВдовинПЮ: Подсистема универсального обмена XML между ИБ 1С через веб-сервис и правила в макетах +++
Функция НужноОбновитьПарольВБезопасномХранилище()
	
	Если НЕ ДополнительныеСвойства.Свойство("ПарольИзменен") ИЛИ НЕ ДополнительныеСвойства.ПарольИзменен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДополнительныеСвойства.Свойство("Пароль");
	
КонецФункции

Функция РасписаниеРегламентногоОбмена()
	
	Если ДополнительныеСвойства.Свойство("Расписание")
		И РасписаниеЗаполнено(ДополнительныеСвойства.Расписание) Тогда
		Возврат ДополнительныеСвойства.Расписание;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Расписание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Расписание.Получить();
	
КонецФункции

Функция РасписаниеРегламентногоОбменаЗаполнено(РасписаниеРегламентногоЗадания)
	
	Возврат РасписаниеЗаполнено(РасписаниеРегламентногоЗадания);
	
КонецФункции

Функция РасписаниеЗаполнено(РасписаниеЗначение)
	
	Если РасписаниеЗначение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПустоеРасписание = Новый РасписаниеРегламентногоЗадания;
	Возврат Строка(РасписаниеЗначение) <> Строка(ПустоеРасписание);
	
КонецФункции

Функция ПредставлениеЗаданияПоПрофилю(НаименованиеПрофиля)
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Обмен XML: %1'"), СокрЛП(НаименованиеПрофиля));
	
КонецФункции

Функция ПравилаОбменаДаннымиЗаполнены()
	
	Если НЕ ЗначениеЗаполнено(ПравилаОбменаДанными) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СодержимоеПравил = ПравилаОбменаДанными.Получить();
	
	Если ТипЗнч(СодержимоеПравил) = Тип("Строка") Тогда
		Возврат НЕ ПустаяСтрока(СокрЛП(СодержимоеПравил));
	КонецЕсли;
	
	Если ТипЗнч(СодержимоеПравил) = Тип("ДвоичныеДанные") Тогда
		Возврат СодержимоеПравил.Размер() > 0;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(СодержимоеПравил);
	
КонецФункции

Функция ЕстьДубльПрефиксовПрофиляИсточника()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОбменаXML.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.рг_НастройкиОбменаXML КАК НастройкиОбменаXML
	|ГДЕ
	|	НастройкиОбменаXML.Источник = ИСТИНА
	|	И НастройкиОбменаXML.Префикс = &Префикс
	|	И НастройкиОбменаXML.ПрефиксБазыПриемника = &ПрефиксБазыПриемника
	|	И НастройкиОбменаXML.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Префикс", Префикс);
	Запрос.УстановитьПараметр("ПрефиксБазыПриемника", ПрефиксБазыПриемника);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
// ВдовинПЮ: ---

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
